app/views/likes/_like_button.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = 1 AND "likes"."pic_id" = 5 LIMIT 1
---

<% if like = current_user.likes.find_by_pic_id(@pic.id) %>