app/controllers/likes_controller.rb

INSERT INTO "likes" ("created_at", "pic_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 19 Dec 2012 09:57:03 UTC +00:00], ["pic_id", 5], ["updated_at", Wed, 19 Dec 2012 09:57:03 UTC +00:00], ["user_id", 1]]
UPDATE "pics" SET "num_likes" = 1, "updated_at" = '2012-12-19 16:03:03.034312' WHERE "pics"."id" = 5
---
  def create
    @like = Like.create(params[:like])
    @pic = @like.pic
    @pic.num_likes +=1
    @pic.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    @like = Like.find(params[:id])
    @like.destroy