app/controllers/pics_controller.rb

SELECT "pics".* FROM "pics"
---
  def index
    @pics = Pic.all

SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @pic = Pic.find(params[:id])

SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @pic = Pic.find(params[:id])

INSERT INTO "pics" ("created_at", "likes", "pic_image", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 10 Dec 2012 10:17:19 UTC +00:00], ["likes", nil], ["pic_image", "IMG_4975.jpg"], ["title", "my first pic"], ["updated_at", Mon, 10 Dec 2012 10:17:19 UTC +00:00], ["user_id", 1]]
---
  def create
    @pic = Pic.new(params[:pic])
    @pic.user = current_user
    respond_to do |format|
      if @pic.save

SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pics" SET "likes" = 6, "updated_at" = '2012-12-11 11:43:20.253092' WHERE "pics"."id" = 3
---
  def update
    @pic = Pic.find(params[:id])

    respond_to do |format|
      if @pic.update_attributes(params[:pic])

SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pics" SET "likes" = 1, "updated_at" = '2012-12-10 17:10:37.736738' WHERE "pics"."id" = 1
---
  def like
    @pic=Pic.find params[:id]
    @pic.likes +=1
    @pic.save